Revit 2026 API

# GradientGradientNoiseHigh Property

---

The property labeled "High" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientNoiseHigh { get; }
```
```vb
Public Shared ReadOnly Property GradientNoiseHigh As String
	Get
```
```cpp
public:
static property String^ GradientNoiseHigh {
	String^ get ();
}
```
```fsharp
static member GradientNoiseHigh : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace